; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	image4 - mode
	thermograph3 - mode
	spectrograph1 - mode
	image0 - mode
	thermograph2 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star6 - direction
	Star8 - direction
	Star1 - direction
	GroundStation7 - direction
	Star5 - direction
	Star3 - direction
	GroundStation4 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image4)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 image4)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon14)
)
(:goal (and
	(have_image Phenomenon9 thermograph3)
	(have_image Planet10 image4)
	(have_image Phenomenon11 thermograph2)
	(have_image Phenomenon12 spectrograph1)
	(have_image Star13 spectrograph1)
	(have_image Phenomenon14 spectrograph1)
	(have_image Star15 thermograph2)
	(have_image Phenomenon16 image4)
))

)

; plan
1. (turn_to satellite1 groundstation4 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 8
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 8
3. (calibrate satellite1 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 0 of 8
4. (turn_to satellite1 phenomenon9 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 8
5. (take_image satellite1 phenomenon9 instrument2 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 1 of 8
6. (turn_to satellite1 groundstation7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 groundstation7)
   goals met: 1 of 8
7. (turn_to satellite0 groundstation4 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 8
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
9. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 1 of 8
10. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 1 of 8
11. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 8
12. (calibrate satellite1 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 1 of 8
13. (turn_to satellite0 phenomenon11 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon11)
   goals met: 1 of 8
14. (take_image satellite0 phenomenon11 instrument0 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 2 of 8
15. (turn_to satellite0 phenomenon16 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 8
16. (take_image satellite0 phenomenon16 instrument0 image4)
   added: (have_image phenomenon16 image4)
   goals met: 3 of 8
17. (turn_to satellite0 planet10 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet10)
   goals met: 3 of 8
18. (take_image satellite0 planet10 instrument0 image4)
   added: (have_image planet10 image4)
   goals met: 4 of 8
19. (turn_to satellite0 star15 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star15)
   goals met: 4 of 8
20. (take_image satellite0 star15 instrument0 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 5 of 8
21. (turn_to satellite1 phenomenon12 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 phenomenon12)
   goals met: 5 of 8
22. (take_image satellite1 phenomenon12 instrument1 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 6 of 8
23. (turn_to satellite1 phenomenon14 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon14)
   goals met: 6 of 8
24. (take_image satellite1 phenomenon14 instrument1 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 7 of 8
25. (turn_to satellite1 star13 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 star13)
   goals met: 7 of 8
26. (take_image satellite1 star13 instrument1 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 8 of 8
